# Inequality Operator (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneId..::..Inequality Operator
DockablePaneId Class See Also
---
Compares two DockablePaneId instances.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator !=(
	DockablePaneId first,
	DockablePaneId second
)
```

Visual Basic
---
```text
Public Shared Operator <> ( _
	first As DockablePaneId, _
	second As DockablePaneId _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator !=(
	DockablePaneId^ first,
	DockablePaneId^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.UI..::..DockablePaneIdThe first DockablePaneId.
second
    Type: Autodesk.Revit.UI..::..DockablePaneIdThe second DockablePaneId.
# ### Return Value
True if the inputs are different, false if they are identical.
# See Also
DockablePaneId Class
Autodesk.Revit.UI Namespace